AuditLogs 
 | where TimeGenerated > ago(90d) 
 | where OperationName contains "Update application – Certificates and secrets management" 
 | where InitiatedBy contains "" 
 | extend target=parse_json(TargetResources[0].displayName) 
 | extend user=parse_json(InitiatedBy.user.userPrincipalName) 
 | project TimeGenerated, OperationName, user, target, AdditionalDetails 
